HW05/app/views/sections/_form.html.erb

    <%= form.label :course_id %>
    <%= form.collection_select :course_id, Course.all, :id, :name %>
---
SELECT "courses".* FROM "courses"