HW05/app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "department", "number", "credithours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Web Applications"], ["department", "Science"], ["number", 1], ["credithours", 4], ["created_at", "2018-12-03 05:42:47.938263"], ["updated_at", "2018-12-03 05:42:47.938263"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save