HW05/app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @sections = Section.all

INSERT INTO "sections" ("semester", "number", "course_id", "roomnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["semester", "Fall semester"], ["number", 2], ["course_id", 1], ["roomnumber", 109], ["created_at", "2018-12-03 05:49:00.711098"], ["updated_at", "2018-12-03 05:49:00.711098"]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save